[
    {
        "code": "MAC0101",
        "name": "Integração na Universidade e na Profissão",
        "credits": "2",
        "wcredits": "0",
        "summary": "Durante o semestre os ingressantes assistirão palestras de alunos veteranos e ex-alunos do BCC, além de alguns convidados. Nas palestras os veteranos compartilharão com os calouros as suas experiências do dia a dia como alunos do BCC. Os veteranos apresentarão os seus grupos extracurriculares de interesse, estudo e pesquisa e suas atividades em comunidade. Espera-se que os ex-alunos descrevam um pouco da sua experiência pessoal como alunos do BCC e profissionais de computação, além de alguma perspectiva na área. Várias palestras podem ser de interesse de estudantes de outros cursos além do BCC.",
        "dependencies": []
    },
    {
        "code": "MAC0105",
        "name": "Fundamentos de Matemática para a Computação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Discurso matemático: leitura e escrita matemática. Estratégias de demonstrações. Princípio da indução finita. Sequências, somas, recorrências e contagem. Algoritmo de Euclides. Divisibilidade nos inteiros. Sistemas de numeração. MDC e MMC. Teorema de Bézout. Teorema fundamental da aritmética. Congruências. O anel dos inteiros módulo m. Os corpos Zp. Relações de equivalência, conjunto quociente, definição de funções e operações no conjunto quociente. Ordem, fecho transitivo de relações. Conjuntos infinitos.",
        "dependencies": []
    },
    {
        "code": "MAC0110",
        "name": "Introdução à Computação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Breve história da computação. \nAlgoritmos: caracterização, notação, estruturas básicas.\nComputadores: unidades básicas, instruções, programa armazenado, endereçamento, programas em linguagem de máquina. \nConceitos de linguagens algorítmicas: expressões; comandos seqüenciais, seletivos e repetitivos; entrada/saída; variáveis estruturadas; funções.  \nDesenvolvimento e documentação de programas.  \nExemplos de processamento não numérico. \nExtensa prática de programação e depuração de programas.",
        "dependencies": []
    },
    {
        "code": "MAC0329",
        "name": "Álgebra Booleana e Aplicações no Projeto de Arquitetura de Computadores",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Sistemas de representação numérica: bases binária, octal e hexadecimal, conversão entre bases, aritmética com números binários. 2. Noções de circuitos lógicos: funções lógicas, tabelas-verdade, portas lógicas. 3. Álgebra booleana: propriedades, exemplos, relação de ordem parcial, decomposição canônica. 4. Expressões e funções booleanas: formas canônicas e sua formas minimais, mapas de Karnaugh e outros métodos para minimização de expressões booleanas. 5. PLA e circuitos combinacionais: somadores, subtratores, verificadores de paridade, codificadores, decodificadores, multiplexadores, demultiplexadores, comparadores, conversores de códigos. 6. Circuitos sequenciais: flip flops, registradores, memória, contadores, noções de análise e projeto de circuitos sequenciais. 7. Noções de organização de computadores.",
        "dependencies": []
    },
    {
        "code": "MAT2453",
        "name": "Cálculo Diferencial e Integral I",
        "credits": "6",
        "wcredits": "0",
        "summary": "Funções trigonométricas. Funções exponenciais. Função composta e função inversa. Limites: noção intuitiva, propriedades algébricas. Teorema do Confronto. Continuidade. Derivadas: definição, interpretações geométrica e física. Regras de derivação, regra de cadeia, derivada da função inversa e derivação implícita. Aplicações. Teorema do valor médio e consequências. Regras de L'Hospital. Gráficos. Resolução de problemas de Máximos e Mínimos. Integral de Riemann. Técnicas de integração. Aplicações: cálculos de volumes de revolução, comprimento de curvas. Fórmula de Taylor.",
        "dependencies": []
    },
    {
        "code": "MAT0112",
        "name": "Vetores e Geometria",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Vetores, operações, módulo de um vetor, ângulo de dois vetores. 2. Dependência linear, bases,     mudança de bases. Sistema de coordenadas no espaço, transformação de coordenadas. 3. Bases ortogonais, matrizes     ortogonais, produto escalar. Orientação do espaço, produto vetorial. 4. Equações vetoriais da reta e do plano no     espaço. Paralelismo entre retas e planos. 5. Ortogonalidade entre retas e planos. Distância de dois pontos, de ponto a     uma reta e a um plano. Áreas e volumes. 6. Curvas planas, cônicas. Curvas e superfícies no espaço. Noções sobre     quádricas.",
        "dependencies": []
    },
    {
        "code": "MAC0239",
        "name": "Introdução à Lógica e Verificação de  Programas",
        "credits": "4",
        "wcredits": "0",
        "summary": "Lógica Formal: cálculo proposicional, sintaxe, semântica, métodos de prova; cálculo de predicados de primeira ordem, noções intuitivas de correção e completude. Verificação de Programas: semântica axiomática dos comandos básicos de programação; lógica de Hoare, pré- e pós-condições, comandos nulos, atribuição, seleção, iteração; invariantes, terminação. Exemplos clássicos de provas de algoritmos.",
        "dependencies": [
            "MAC0110"
        ]
    },
    {
        "code": "MAE0119",
        "name": "Introdução à Probabilidade e à Estatística",
        "credits": "6",
        "wcredits": "0",
        "summary": "1) Estatística Descritiva uni e bidimensional; 2) Probabilidade; 3) Variáveis aleatórias e principais distribuições discretas e contínuas; 4) Aproximação normal; 5) Distribuições amostrais e Teorema Limite Central; 6) Estimadores e propriedades; 7) Estimação pontual e por intervalo; 8) Testes de hipóteses para uma média, uma proporção; 9) Testes de comparação de médias e proporções; Testes qui-quadrado; 10) Teste de Hipóteses para Variância; 11) Regressão e correlação.",
        "dependencies": []
    },
    {
        "code": "MAC0121",
        "name": "Algoritmos e Estruturas de Dados I",
        "credits": "4",
        "wcredits": "0",
        "summary": "Noções informais de prova de correção e medida do desempenho de algoritmos. Noções de tipos abstratos de dados. Vetores e matrizes. Strings (cadeias de caracteres). Alocação dinâmica de memória e redimensionamento de vetores. Apontadores. Listas ligadas. Estruturas ligadas não lineares. Árvores binárias. Pilhas e filas (implementadas com vetores e listas ligadas). Aplicações. Filas de prioridade (implementadas com heaps). Aplicações. Recursão. Aplicações. Algoritmos de ordenação elementares. Algoritmo quicksort. Algoritmo mergesort. Algoritmo heapsort. Algoritmo radixsort (ordenação digital). Ordenação indireta (ordenação de apontadores). Processamento elementar de texto. Aplicações. Tabelas de símbolos elementares: implementações baseadas em vetores, listas ligadas, busca binária, e árvores binárias de busca. Aplicações. As aplicações podem envolver várias estruturas de dados compostas (como vetores de listas ligadas) e várias estratégias algorítmicas (gulosa, divisão e conquista, programação dinâmica, backtracking, busca em largura, etc.).",
        "dependencies": [
            "MAC0110"
        ]
    },
    {
        "code": "MAC0216",
        "name": "Técnicas de Programação I",
        "credits": "4",
        "wcredits": "2",
        "summary": "Conceitos básicos de arquitetura de computadores. Linguagem de montagem e montadores, ligação de código objeto, interface com hardware e com linguagens de alto nível. Interação com o sistema operacional no nível do shell: streams, entrada e saída padrão, redirecionamento e pipes. Shell scripts. Gerenciamento de compilação de programas e bibliotecas com ferramentas como make. Modularização de código. Ligação de módulos, estática e dinâmica. Construção de bibliotecas. Técnicas de depuração e teste de programas. Técnicas e ferramentas de controle de versão. Construção de um sistema em uma linguagem procedimental (por exemplo, C). Estudo de uma linguagem dinâmica de script (por exemplo, Python ou Ruby). Introdução aos conceitos de orientação a objetos no âmbito de linguagens dinâmicas.",
        "dependencies": [
            "MAC0110"
        ]
    },
    {
        "code": "MAT2454",
        "name": "Cálculo Diferencial e Integral II",
        "credits": "4",
        "wcredits": "0",
        "summary": "Funções de duas ou mais variáveis: limites, continuidade, diferenciabilidade. ; Gradiente; Regra da cadeia; Teorema do Valor Médio; Derivadas de ordem superior; Teorema de Schwarz (enunciado); Fórmula de Taylor; Máximos e Mínimos; Multiplicadores de Lagrange.",
        "dependencies": [
            "MAT2453"
        ]
    },
    {
        "code": "MAT0122",
        "name": "Álgebra Linear I",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Espaços vetoriais: definição, subespaços, dependência linear, bases, dimensão. 2. Cálculo matricial,     determinantes, sistemas lineares. 3. Transformações lineares e matrizes, núcleo, imagem, posto. 4. Espaços com     produto interno: produto interno, norma, ortogonalidade, processo de Gram-Schmidt, complemento ortogonal,     projeção. Autovalores e autovetores.",
        "dependencies": [
            "MAT0112"
        ]
    },
    {
        "code": "MAC0102",
        "name": "Caminhos no Bacharelado em Ciência da Computação",
        "credits": "2",
        "wcredits": "0",
        "summary": "Durante o semestre os ingressantes assistirão a palestras de representantes do grupos de pesquisa do DCC e de pesquisadores de centros de excelência. Docentes do DCC apresentarão o DCC, tópicos de suas pesquisas, história da computação e perspectivas da área, além de sugerir trilhas de disciplinas compatíveis com eventuais interesses dos estudantes.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0323",
        "name": "Algoritmos e Estruturas de Dados II",
        "credits": "4",
        "wcredits": "2",
        "summary": "Tipos abstratos de dados e suas implementações. Análise da complexidade de tempo e espaço (pior caso, caso médio, análise amortizada, estimativas empíricas). Tabelas de símbolos: árvores de busca balanceadas, tabelas de espalhamento (hashing), tries ternárias de busca. Grafos: busca em profundidade, busca em largura, caminhos mínimos (algoritmo de Dijkstra), ordenação topológica, componentes fortes. Processamento de texto: expressões regulares e autômatos, busca de padrões (algoritmo KMP, algoritmo de Rabin-Karp), compressão de dados (códigos de Huffman), vetores de sufixos. Tópicos opcionais: árvores B, algoritmo LZW de compressão de texto, gerenciamento de memória (coleta de lixo).",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0209",
        "name": "Modelagem e Simulação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Metodologia Científica (experimentos, medidas, leis, corroboração, falseabilidade); sistemas físicos e sua relação com as \"leis da Física\"; modelagem, simulação e análise de sistemas físicos; aplicações tecnológicas. Aplicação dos conceitos em tópicos da mecânica clássica, como cinemática e dinâmica de objetos pontuais, corpo rígido e sistemas de partículas, movimento harmônico simples e mecânica ondulatória. O impacto da tecnologia de medida (e.g., aproximação da Biologia à engenharia) e dos computadores na ciência moderna (i.e., seu papel na descoberta de conhecimento). Outros modelos: modelos discretos e estoc ásticos (simulação de tecidos de corpos de animais por automatos celulares, ruído em sistemas físicos, passeio aleatório, etc.)",
        "dependencies": [
            "MAC0110"
        ]
    },
    {
        "code": "MAT0236",
        "name": "Funções Diferenciáveis e Séries",
        "credits": "4",
        "wcredits": "0",
        "summary": "Funções diferenciáveis de R^n em R^p.Regra da Cadeia. Funções de classe C^k.Teorema da Função Implícita para funções de R^2 em R (enunciado e demonstração).Enunciado dos teoremas da função inversa e implícita para funções de R^n em R^p.Método dos multiplicadores de Lagrange para funções em R^n sujeitas a p vínculos.Sequências e séries numéricas.Critérios de convergência.Sequências e séries de funções.Convergência pontual e uniforme.Derivação e integração termo a termo.Séries de potências.",
        "dependencies": [
            "MAT2454"
        ]
    },
    {
        "code": "MAC0210",
        "name": "Laboratório de Métodos Numéricos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Computação científica. Aritmética de ponto flutuante. Equações não lineares em uma variável. Interpolação polinomial. Interpolação polinomial por partes. Diferenciação numérica. Integração numérica.",
        "dependencies": [
            "MAC0110",
            "MAT0122"
        ]
    },
    {
        "code": "MAC0316",
        "name": "Conceitos Fundamentais de Linguagens de Programação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Linguagens funcionais. Funções como valores de primeira ordem; polimorfismo; ambientes e fechamentos; avaliação \"adiada\"; linguagens funcionais; linguagens orientadas a objetos. Tipos abstratos de dados. Módulos. Herança e hierarquias. Linguagens lógicas. Predicados, cláusulas e o modelo de unificação. Implementação dos vários paradigmas em um interpretador; compilação vs implementação. Administração de memória; pilha vs heap; coleta de lixo.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0338",
        "name": "Análise de Algoritmos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Complexidade de tempo e espaço de algoritmos. Análise assintótica: notação O, Ômega e Teta. Análise de pior caso e análise probabilística. Análise amortizada de estruturas dinâmicas (tabelas dinâmicas, union find, splay trees). Paradigmas de projeto de algoritmos (programação dinâmica, divisão e conquista, aleatorização) e métodos de análise. Algoritmos gulosos. Estudo de casos: análise do algoritmo quicksort aleatorizado, análise de tabelas de hashing, problema da mochila, multiplicação de inteiros (algoritmo de Karatsuba) e matrizes (algoritmo de Strassen), árvores geradoras mínimas de grafos (algoritmos de Prim e Kruskal). Cota inferior de ordenação. Introdução à teoria da complexidade computacional. Redução entre problemas. As classes P, NP, e NP-completo. Tópicos opcionais: fluxo em redes (algoritmo de Ford-Fulkerson), programação linear, todos os caminhos mínimos num grafo (algoritmo de Floyd-Warshall), algoritmos de aproximação, algoritmos probabilísticos.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0422",
        "name": "Sistemas Operacionais",
        "credits": "4",
        "wcredits": "2",
        "summary": "Introdução a arquiteturas: convencionais, multiprocessadores, paralelas com memória distribuída e redes. Multiprocessamento e multiprogramação. Gerenciamento de memória: memória real vs virtual, paginação e segmentação, memória cache. Processos: estados, contexto, gerenciamento pelo kernel, escalonamento, sinais e interrupções. Comunicação local: pipes, FIFOs, message queues, memória compartilhada. Comunicação remota: síncrona, assíncrona, sockets, chamada remota de procedimentos (RPC) e rendezvous. Protocolos de comunicação em redes: IP, TCP, UDP. Threads: gerenciamento, sincronização, semáforos, regiões críticas condicionais, monitores. Entrada e saída: aspectos de hardware e software, dispositivos de bloco e caracteres (terminais, discos, relógio, rede), independência de dispositivo, drivers. Sistemas de arquivos. Tipos de arquivos: seqüenciais, acesso indexado, acesso direto, diretórios hierárquicos, organização física e acesso a arquivos, mecanismos de proteção distribuída. \nSegurança.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0350",
        "name": "Introdução ao Desenvolvimento de Sistemas de Software",
        "credits": "4",
        "wcredits": "2",
        "summary": "Técnicas para coleta de requisitos, modelagem, projeto e implementação de sistemas de software. Conceitos de projetos de sistemas avançados. Qualidade de software. Gerência e manutenção de software. Persistência de dados: projeto conceitual, lógico e físico de bancos de dados. Modelo entidade relacionamento e modelo relacional: álgebra relacional, cálculo relacional e linguagem SQL. Controle de Concorrência.",
        "dependencies": [
            "MAC0316"
        ]
    },
    {
        "code": "FLC0474",
        "name": "Língua Portuguesa",
        "credits": "3",
        "wcredits": "0",
        "summary": "Aspectos linguísticos e discursivos do texto acadêmicoAnálise de textos acadêmicos com ênfase aos da área de especialidade (Ciências Exatas: Ciências da Computação, Estatística e Matemática), do ponto de vista da estrutura linguística e discursiva.Produção e edição de textos acadêmicos da área de especialidade (Ciências Exatas: Ciências da Computação, Estatística e Matemática).",
        "dependencies": []
    },
    {
        "code": "MAC0499",
        "name": "Trabalho de Formatura Supervisionado",
        "credits": "0",
        "wcredits": "16",
        "summary": "O trabalho de formatura deverá ser desenvolvido ao longo de um ano sob a supervisão de um docente. O tema a ser explorado no projeto deve estar relacionado à computação e o estudante deverá demonstrar, por meio do projeto e de uma monografia, o emprego de conhecimentos adquiridos durante o curso.",
        "dependencies": [
            "MAC0338",
            "MAC0422"
        ]
    },
    {
        "code": "MAE0217",
        "name": "Estatística Descritiva",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tIntrodução: estatística descritiva e inferência estatística, tipos de dados, bancos de dados, ordem de grandeza, precisão e arredondamento de dados quantitativos, proporções e porcentagens, taxas e números índices, sugestões para construção e apresentação de gráficos e tabelas.2.\tRepresentação gráfica e tabular da distribuição de dados: tabelas de frequências, gráficos de barras e do tipo \"torta\", histogramas, função de distribuição empírica.3.\tMedidas resumo: medidas de posição, de dispersão, de assimetria e curtose, gráficos do tipo \"boxplot\".4.\tModelos para distribuições de frequências: gráficos de probabilidade, estatística de Pearson para avaliação de aderência.5.\tAssociação entre variáveis qualitativas: tabelas de contingência, coeficientes de associação, sensitividade e especificidade, risco relativo, razão de chances.6.\tAssociação entre uma variável quantitativa e uma variável qualitativa: homogeneidade de distribuições (análise de variância com um fator), gráficos de médias, gráficos de perfis, regressão logística.7.\tAssociação entre variáveis quantitativas: gráficos de dispersão, correlação linear, concordância, gráficos de perfis, regressão linear simples, suavização.8.\tAssociação entre três ou mais variáveis: tabelas de contingência de múltiplas entradas, distribuições multivariadas, matrizes de covariâncias, análise de variância com dois ou mais fatores, regressão linear múltipla.9.\tOutros tópicos: elaboração de relatórios técnicos, análise de sobrevivência e tábuas atuariais, modelos estatísticos (parametrização e identificabilidade).",
        "dependencies": [
            "MAE0119"
        ]
    },
    {
        "code": "MAE0221",
        "name": "Probabilidade I",
        "credits": "6",
        "wcredits": "0",
        "summary": "1.\tContagem: princípio multiplicativo, permutações, combinações.2.\tEspaço de probabilidade.3.\tProbabilidade condicional e independência.4.\tVariáveis e vetores aleatórios: definição, caracterizações e propriedades.5.\tEsperança matemática, funções geradoras de probabilidade e de momentos e suas propriedades.6.\tPrincipais distribuições de probabilidade (univariadas e multivariadas): uniforme discreta, Bernoulli, binomial, geométrica, Poisson, binomial negativa, hipergeométrica, multinomial, exponencial, normal, Cauchy e uniforme contínua.7.\tTransformações de variáveis: direta e método do jacobiano. Distribuição da soma, produto e quociente de variáveis aleatórias.8.\tEstatísticas de ordem, distribuições t-Student, F-Snedecor, qui-quadrado, gama, beta e suas relações.9.\tDistribuição normal multivariada e propriedades.10.\tLei dos grandes números.11.\tTeorema limite central.s relações). 7. Lei dos Grandes Números. 8. Teorema do Limite Central.",
        "dependencies": [
            "MAE0119",
            "MAT2454"
        ]
    },
    {
        "code": "MAE0228",
        "name": "Noções de Probabilidade e Processos Estocásticos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tProbabilidade em espaços amostrais discretos.2.\tProbabilidade condicional e independência.3.\tVariáveis aleatórias discretas: binomial, hipergeométrica, geométrica e Poisson4.\tVariáveis aleatórias contínuas: exponencial e gama.5.\tNoções gerais sobre processos estocásticos.6.\tCadeias de Markov a parâmetro discreto: definição, probabilidade de transição, classificação dos estados e medidas de probabilidade invariantes.7.\tProcesso de Poisson: propriedades e aplicações.8.\tNoções de cadeias de Markov a parâmetro contínuo.",
        "dependencies": [
            "MAE0119"
        ]
    },
    {
        "code": "MAE0312",
        "name": "Introdução aos Processos Estocásticos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tConceitos básicos e exemplos.2.\tConstrução de cadeias de Markov.3.\tComportamento assintótico das cadeias de Markov. Tempo médio de recorrência. Medidas invariantes. Reversibilidade.4.\tConvergência em distribuição via acoplamento.5.\tProcessos pontuais e processos de Poisson.6.\tTeoria da renovação a tempo discreto e teorema chave.7.\tMartingales discretos.8.\tProcessos Markovianos de salto. Construção. Explosão.",
        "dependencies": [
            "MAE0221"
        ]
    },
    {
        "code": "MAE0499",
        "name": "Processos Estocásticos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tRevisão das distribuições contínuas: uniforme, exponencial, gama.2.\tDistribuições condicionais e esperança condicional.3.\tIntrodução aos processos estocásticos, trajetórias e séries temporais (motivação).4.\tCadeias de Markov: passeios aleatórios simples, Galton-Watson, nascimento e morte.5.\tProcesso de Poisson e tempos exponenciais.6.\tProcessos de Markov.7.\tNoções de processos estacionários.",
        "dependencies": []
    },
    {
        "code": "MAE0224",
        "name": "Probabilidade II",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tConvergência de sequências de variáveis aleatórias.2.\tFunções características.3.\tLeis fortes e leis fracas dos grandes números.4.\tDistribuições de somas de variáveis aleatórias.5.\tTeorema limite central.6.\tTópicos de passeios aleatórios.7.\tDistribuições de valores extremos.",
        "dependencies": [
            "MAT0236"
        ]
    },
    {
        "code": "MAE0399",
        "name": "Análise de Dados e Simulação",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tAnálise exploratória de um ou mais conjuntos de dados.2.\tMétodos gráficos: medidas robustas, P-P e Q-Q plots.3.\tRegressão e análise de resíduos.4.\tSimulação estática: simulação de variáveis aleatórias, métodos de Monte Carlo.5.\tSimulação de eventos discretos: filas, controle de estoques, etc.6.\tReamostragem.7.\tAceitação-rejeição.",
        "dependencies": []
    },
    {
        "code": "MAE0515",
        "name": "Introdução à Teoria dos Jogos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tCaracterização de um jogo. Jogos cooperativos e não-cooperativos.2.\tJogos de uma pessoa.3.\tJogos de duas pessoas: de soma zero, não-cooperativos (de soma não-zero) e cooperativos.4.\tJogos de n pessoas.",
        "dependencies": [
            "MAE0119",
            "MAT2453"
        ]
    },
    {
        "code": "4302112",
        "name": "Física II",
        "credits": "6",
        "wcredits": "0",
        "summary": "Oscilações harmônica, amortecida, forçada, amortecida-forçada. Ressonância. Noções básicas da teoria da elasticidade. Ondas em meios elásticos. Reflexão de ondas. Superposição de ondas. Interferência e Difração. Batimentos. Ondas confinadas. Propriedades dos gases (ideal e real) e algumas relações entre grandezas macroscópicas e microscópicas. Primeira Lei da Termodinâmica. Conceitos importantes: Calor, Trabalho, Energia Interna e Entalpia. Segunda Lei da Termodinâmica. Conceitos importantes: Entropia, Energia Livre de Gibbs e Helmholtz.  Aplicações: motores/refrigeradores.",
        "dependencies": []
    },
    {
        "code": "4302401",
        "name": "Mecânica Estatística",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tAs leis da termodinâmica.2.\tNoções de probabilidade.3.\tRepresentação microcanônica. Entropia de Boltzmann. 4.\tRepresentação canônica. Distribuição de Maxwell das velocidades. Função de partição e conexão com a termodinâmica. 5.\tModelo de Einstein para o calor específico dos sólidos. Gás ideal monoatômico. Paradoxo de Gibbs.  Gás ideal diatômico.6.\tGás de fótons, radiação térmica. Gás de fônons, cadeia linear, teoria de Debye.7.\tRepresentação grande-canônica. Distribuição de Bose-Einstein e de Fermi- Dirac.8.\tGás de elétrons livres, capacidade térmica eletrônica.9.\tGases e líquidos, integral de configuração, segundo coeficiente virial, teoria de van de Waals.",
        "dependencies": []
    },
    {
        "code": "GMG0630",
        "name": "Elementos de Mineralogia e Petrologia",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Aulas teóricas: a) Módulo Mineralogia:Introdução ao tema. Constituição da Crosta Terrestre: minerais e rochas. Definições. Fenômenos que relacionam composição química e estrutura cristalina: Isomorfismo, Polimorfismo e Solução Sólida. Propriedades físicas e morfológicas dos minerais. Processos formadores de minerais. Critérios de Classificação mineral.b) Módulo Petrologia:As Rochas: Processos e Características. Ciclo das rochas na crosta. Origem e evolução das rochas ígneas. Vulcanismo e seus produtos: evidências de um planeta dinâmico. Processos exógenos e formação das rochas sedimentares. Gênese e origem das rochas metamórficas. Rochas do Estado de São Paulo.2. Aulas Práticas:Reconhecimento de materiais da crosta terrestre. Os minerais e seus aspectos. As propriedades físicas observadas em alguns minerais. As propriedades físicas dos minerais observados em rochas. Características gerais dos grandes grupos de rochas. Rochas Ígneas. Rochas Sedimentares. Rochas Metamórficas. Rochas do estado de São Paulo.",
        "dependencies": []
    },
    {
        "code": "0440620",
        "name": "Geologia Geral",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. A Terra como Planeta. Origem e estrutura da Terra.\n2. Introdução à tectônica de placas. Deriva dos continentes.\n3. Materiais terrestres: minerais e rochas.\n4. Ciclo das rochas.\n5. Intemperismo, formação de solos e agentes erosivos, transporte de sedimentos, ambientes geológicos de sedimentação. Formação de rochas sedimentares.\n6. Ação geológica dos ventos, gelo e da água. Água subterrânea.\n7. Vulcanismo, plutonismo, metamorfismo.\n8. Deformação da crosta terrestre: dobras e falhas.\n9. Tempo geológico e aspectos da geologia histórica.\n10. Fundamentos da Geologia do Estado de São Paulo.\n\n* Aulas práticas de minerais, rochas sedimentares, ígneas e metamórficas.",
        "dependencies": []
    },
    {
        "code": "QBQ0104",
        "name": "Bioquímica e Biologia Molecular",
        "credits": "4",
        "wcredits": "0",
        "summary": "Água e tampões biológicos. Estrutura e propriedades de aminoácidos, proteínas, enzimas, lipídios, carboidratos e membranas biológicas. Visão geral e integrada do metabolismo celular. Glicólise. Fermentações lática e alcoólica. Gliconeogênese. Beta-oxidação de ácidos graxos. Acetil-CoA: formação e destino. Ciclo de Krebs. Cadeia de transporte de elétrons e fosforilação oxidativa. Metabolismo do Glicogênio e Via das Pentoses-Fosfato. Síntese de ácidos graxos. Metabolismo de aminoácidos. Regulação metabólica, ação hormonal no controle do metabolismo (insulina, glucagon e epinefrina). Integração e alterações metabólicas fisiológicas e patológicas.\nBiologia Molecular: Estrutura do DNA e RNA. Dogma Central de Biologia Molecular: Replicação, Transcrição e Biossíntese de proteínas.",
        "dependencies": []
    },
    {
        "code": "QBQ1252",
        "name": "Bioquímica Metabólica",
        "credits": "4",
        "wcredits": "1",
        "summary": "Estrutura de proteínas. Alosteria. Enzimas, cinética, inibição e mecanismos de catálise. Princípios termodinâmicos e cinéticos que regem o metabolismo celular. Transporte através de membranas. Metabolismo de carboidratos. Metabolismo intermediário (Ciclo de Krebs). Cadeia de transporte de elétrons e fosforilação oxidativa. Metabolismo de ácidos graxos e proteínas. Regulação e integração metabólica.",
        "dependencies": []
    },
    {
        "code": "QBQ1354",
        "name": "Biologia Molecular",
        "credits": "4",
        "wcredits": "1",
        "summary": "Evidências de que o DNA é a molécula da hereditariedade. Estrutura e propriedades dos ácidos nucléicos: DNA e RNA. Replicação, mutação e reparo do DNA. Transcrição e processamento do RNA. Código Genético e biossíntese de proteínas. Noções básicas do controle da Expressão Gênica. Princípios de Clonagem Gênica e biotecnologia (estrutura gênica). Vetores para clonagem de DNA e construção de bibliotecas de genes. Leitura e análise bioinformática de seqüências DNA. Aplicações tecnológicas da Biologia Molecular (expressão de proteínas recombinantes). Aulas de Laboratórios podem incluir: Extração de DNA; PCR; eletroforese em gel de agarose; bioinformática (introdução a genômica comparativa: bancos de dados genômicos). Biologia Molecular (expressão de proteínas recombinantes); transformação de bactérias.",
        "dependencies": []
    },
    {
        "code": "AGA0215",
        "name": "Fundamentos de Astronomia",
        "credits": "4",
        "wcredits": "0",
        "summary": "(1) Mecânica do Sistema Solar: Observando o céu. Órbitas e gravidade. (2) Estrutura e Formação do Sistema Solar: Planetas. Corpos menores e Transnetunianos. Formação do Sistema Solar. Exoplanetas. (3) A Terra & a Lua: Rotação da Terra. Estações. Fases da Lua. Marés. Eclipses. (4) Radiação: Natureza da Luz. Radiação eletromagnética. (5) Espectros. Estrutura do Átomo. Formação de linhas espectrais. Efeito Doppler. (6) Telescópios e detectores: Telescópios. Detectores ópticos e instrumentos. Infravermelho. Rádio-telescópios. Astronomia espacial. (7) O Sol: Atmosfera. Atividade. Ciclo solar. Interior solar. Produção de Energia. (8) Estrelas: Brilho.Cor. Classificação Espectral. Diagrama HR. Estrelas Binárias. (9) Distâncias: Paralaxe. Escalas de distâncias. Estrelas Variáveis. (10) Evolução Estelar: Evolução após a Seqüência Principal. Gigantes Vermelhas. Nebulosas Planetárias. (11) Objetos Compactos: Fim de vida das estrelas de alta massa. Estrelas de nêutrons. Pulsares. Buracos Negros. (12) Nossa Galáxia: Meio Interestelar: Componentes. Formação de estrelas. A Via Láctea: Estrutura. Curva de Rotação. Massa da Galáxia. Formação da galáxia. (13) Galáxias Normais e Ativas: Tipos de galáxias. Propriedades das galáxias. Galáxias ativas. Lentes gravitacionais. (14) Estrutura do Universo: Distribuição de galáxias no espaço. Evolução de galáxias. Matéria escura. (15) Cosmologia: Idade do Universo. Modelos do Universo. Big Bang. universo inflacionário.",
        "dependencies": []
    },
    {
        "code": "AGA0106",
        "name": "Astronomia de Posição",
        "credits": "4",
        "wcredits": "0",
        "summary": "1) Cinemática Celeste. (a) Definição da Esfera Celeste; (b) Sistemas de Coordenadas horizontais, geográficas, horárias, equatoriais e eclípticas; Relações entre Sistemas de Coordenadas; (c) Escalas de Medida de Tempo; Tempo solar e sideral; Tempo médio e verdadeiro; Equação do tempo e dos equinócios; Tempo Universal; Tempo Atômico e Tempo Universal Coordenado; (d) Calendários; Definição de dia, semana, mês e ano; Calendário Juliano e Gregoriano; Data Juliana;(e) Precessão e Nutação; Causas e efeitos; (f) Refração Atmosférica; (g) Movimento próprio de Estrelas, Paralaxe estelar e Aberração da Luz. 2) Astronomia Clássica: (a) Cosmografia Histórica; Descrição dos modelos de Mundo adotados ao longo do tempo; (b) Movimento Elíptico da Terra; Estudo da elipse; Equação de Kepler; (c) Leis de Kepler e Determinação de Distâncias no sistema Solar; Raio da Terra; Distância da Terra à Lua; Distância da Terra ao Sol; Raios orbitais dos planetas.",
        "dependencies": []
    },
    {
        "code": "MAC0213",
        "name": "Atividade Curricular em Comunidade",
        "credits": "0",
        "wcredits": "4",
        "summary": "Passamos a descrever algumas das possíveis atividades que podem ser desenvolvidas nesta disciplina. Desenvolver atividades pedagógicas de intercâmbio de conhecimentos entre a universidade e a população: ministrar cursos, fazer ou promover conferências, palestras, ciclos de estudos, debates, oficinas, seminários, exposições, concertos, recitais, espetáculos, mostras, feiras, campanhas, formação ou promoção de grupos artísticos, etc. Promover meios de conhecimento de realidades específicas, elaborando, cooperativamente, levantamentos, pesquisas de campo, diagnósticos, projetos e colaborando no encaminhamento de soluções de problemas. Vivenciar práticas profissionais de forma cooperativa e multidisciplinar em situações concretas de demandas da população. Acompanhar, apoiar e assessorar projetos comunitários em desenvolvimento. Desenvolver atividades artísticas ou de resgate da memória cultural em comunidades. Agregar aspectos qualitativos de interesse ou de necessidade da população nas ações promovidas pelo poder público ou por organizações da sociedade civil. Os resultados desta atividade do aluno deverão ser apresentado em um relatório e em uma seção de posters.",
        "dependencies": []
    },
    {
        "code": "MAC0214",
        "name": "Atividade Curricular em Cultura e Extensão",
        "credits": "0",
        "wcredits": "4",
        "summary": "O aluno deve se empenhar em alguma atividade independente supervisionada por um professor do departamento de Ciência da Computação. Espera-se que o aluno participe ativamente durante um semestre de atividades de cultura e extensão tais como participação em projetos de software (como os promovidos pelo Centro de Competência de Software Livre), participação ativa em treinamentos para Olimpíadas Científicas (como a Maratona de Programação ou a Olimpíada de Matemática) ou mesmo alguma atividade inovadora desenvolvida pelo aluno. O professor supervisor avaliará a adequação das atividades e a participação do aluno. Os resultados dos esforços do aluno deverão ser apresentado em um relatório e em uma seção de posters.",
        "dependencies": []
    },
    {
        "code": "MAC0215",
        "name": "Atividade Curricular em Pesquisa",
        "credits": "0",
        "wcredits": "4",
        "summary": "Serão desenvolvidas atividades compatíveis com uma iniciação científica e de participação em projetos de pesquisa. Os resultados desta atividade do aluno deverão ser apresentado em um relatório e em uma seção de posters.",
        "dependencies": []
    },
    {
        "code": "MAC0333",
        "name": "Armazenamento e Recuperação de Informação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Introdução ao armazenamento e recuperação de informação. Conceitos gerais de bases de dados documentacionais. Pesquisa probabilística (probabilistic retrieval). Classificação/indexação automática. Técnicas de compressão de informação. Sistemas de Informação: sistemas de informações gerenciais, automação de bibliotecas, automação de escritórios. Tendências de software e hardware para armazenamento e recuperação de informação.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0335",
        "name": "Leitura Dramática",
        "credits": "4",
        "wcredits": "0",
        "summary": "Aulas de leitura, discussão e interpretação de textos de autores consagrados. Técnicas de impostação de voz, apresentação em público, linguagem corporal, etc.",
        "dependencies": []
    },
    {
        "code": "MAC0337",
        "name": "Computação Musical",
        "credits": "4",
        "wcredits": "0",
        "summary": "1 - Sinais de áudio digital: representação, análise espectral e filtros. \n2 - Síntese: modelos de síntese (aditiva, subtrativa e não-linear) e de instrumentos digitais (interface e mapeamento). \n3 - Análise: espectrogramas, características sonoras, detecção (onset e frequência fundamental) e classificação de sinais sonoros. \n4 - Aplicações: tópicos selecionados dentre acústica de salas, acústica de instrumentos, sonificação e recuperação de informação musical.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0417",
        "name": "Visão e Processamento de Imagens",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Introdução.  2. Ótica, radiometria (incluindo modelos de cor) e formação de imagens (amostragem e quantização).  3. Sensores: visão, câmeras CCD, scanner, tomógrafos, radar, ultra-som, profundidade, laser, etc.  4. Lista de aplicações: processamento de documentos (OCR, WEB, etc.), reconhecimento de faces, mamografia, reconstrução 2D, reconstrução 3D, análise de imagens de microscopia (biologia, metalografia, etc.), bases de dados multi-mídia, vídeo digital, análise de estrutura, mecânica por movimento, visão robótica, reconhecimento de placas de veículos, etc.  5. Lista de problemas:  processamento de imagens (filtragem, segmentação, realce, codificação, restauração, registro, fusão, descrição quantitativa, visualização colorida, visualização em níveis de cinza);  visão 2D (texturas, análise de formas, classificação);  visão 3D (calibração e geometria, análise no espaço-tempo, movimento, estéreo, profundidade, formas pelo sombreamento, visão ativa, interpretação de cenas).  6. Topologia digital.  7. Estatística e operações pontuais.  8. Transformações lineares: Fourier, wavelets.  9. Transformações não-lineares.  10. Morfologia matemática.  11. Reconhecimento de padrões.",
        "dependencies": []
    },
    {
        "code": "MAC0420",
        "name": "Introdução a Computação Gráfica",
        "credits": "4",
        "wcredits": "0",
        "summary": "Fundamentos: histórico e aplicações, interfaces gráficas, dispositivos gráficos, e o pipeline gráfico. Padrões para representação de imagens e cores. Representação e construção de objetos geométricos. Geometrias, sistema de coordenadas e transformações geométricas. Recortes e janelas. Visibilidade, oclusão, buffer de profundidade. Raytracing. Mapeamento de texturas. Representação de curvas e superfícies. Representação de objetos tridimensionais. Animação.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0430",
        "name": "Algoritmos e Complexidade de Computação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Modelos de computação; máquinas de Turing. Tese de Church. Redutibilidade e problemas indecidíveis. Complexidade, problemas decidíveis em tempo polinomial. Não-determinismo versus determinismo. Redutibilidade e problemas NP-completos. Hierarquia polinomial de complexidade. Redutibilidade e problemas PESPAÇO-completos.",
        "dependencies": []
    },
    {
        "code": "MAC0434",
        "name": "Tópicos de Sistemas de Computação",
        "credits": "4",
        "wcredits": "0",
        "summary": "Arquitetura de Computadores. Algoritmos Paralelos e Distribuídos. Banco de Dados e     Sistemas de Informação. Paradigmas e Linguagens de Programação. Sistemas de Simulação. Sistemas     Distribuídos e Redes. Engenharia de Software. Computação Gráfica. Visão Computacional. Sistemas     Operacionais. Sistemas Multimídia. Inteligência Artificial e Sistemas Especialistas. Redes Neuronais.",
        "dependencies": []
    },
    {
        "code": "MAC0446",
        "name": "Princípios de Interação Humano",
        "credits": "4",
        "wcredits": "0",
        "summary": "Evolução da área de IHC, introdução de conceitos como usabilidade e experiência do usuário. Paradigmas de interação. Modelos de IHC (GOMS, lei de Fitts). Fatores humanos que devem ser considerados no design de interação, como cognição, atenção, percepção e memória. Design centrado no usuário, design participativo e paralelo. Ciclo de design, descoberta de necessidades do usuário, projeto de interfaces, desenvolvimento de protótipos de baixo e alto nível, avaliação de interfaces.",
        "dependencies": []
    },
    {
        "code": "MAC0458",
        "name": "Direito e Software",
        "credits": "2",
        "wcredits": "0",
        "summary": "Direito como ciência humana. Direito e poder, direito e sociedade. Panorama geral do direito brasileiro. Direito do Consumidor. Legislação Civil e Empresarial. Noções sobre Direito do Trabalho. Computação: regulamentação da profissão, posição da SBC, Diploma e reserva de mercado. Propriedade intelectual: formas de proteção no direito brasileiro. Lei do software. Direitos autorais, patentes e modelos de utilidade. Domínio Público. Crime de violação de direitos autorais. Software livre na administração pública. Noções sobre licitações. Formas de compartilhamento de propriedade intelectual. Free Software, Open Source, Creative Commons, Copyright, Copyleft e Fair Use. Comparação das legislações sobre propriedade intelectual no Brasil, EUA, e Europa. DMCA - Digital Millenium Copyright Act. Jurisprudência, acordos internacionais e principais agentes. Patentes de algoritmos. Casos para debate: Pirate Party, Pirate Bay e Napster; Projetos de Lei sobre crimes na Internet; Condenações de Violação à Livre Concorrência de Software; Marco civil da Internet; Software livre, inclusão digital e social; Software livre: compartilhamento de informações e conhecimento.",
        "dependencies": []
    },
    {
        "code": "MAC0468",
        "name": "Tópicos em Computação Gráfica",
        "credits": "4",
        "wcredits": "0",
        "summary": "Fundamentos de ray tracing/casting e path tracing Aproximações da equação de renderização Renderização em tempo real Renderização não foto-realista Utilização de GPUs para aceleração Superfícies de subdivisão Simulação de fluidos Cinematica direta e inversa Detecção de colisão e resposta Dinâmica de corpo rídido Animação procedural",
        "dependencies": []
    },
    {
        "code": "MAC0469",
        "name": "Construção de Software como Serviço em Computação em Nuvem",
        "credits": "4",
        "wcredits": "2",
        "summary": "Arquitetura de Aplicações SaaS e as várias camadas de Sistemas Web modernos, incluindo TCP/IP, DNS, HTTP, URIs, HTML, CSS e o Modelo REST.\n\nDesenvolvimento Ágil de Software incluindo Desenvolvimento Guiado por Testes (TDD), arcabouços para testes automatizados, Gestão Ágil de Projetos, Ferramentas para controle de versões e para gestão dinâmica de requisitos do cliente.\n\nLinguagens dinâmicas para desenvolvimento Web tais como Ruby ou Python. Como características avançadas como Reflexão e Metaprogramação facilitam o desenvolvimento de sistemas flexíveis, enxutos e robustos.\n\nArcabouços OO para desenvolvimento Web tais como Rails, Sinatra e Django\n\nMapeamento Objeto-Relacional para SaaS utilizando arcabouços tais como Rails, Django ORM e SQLAlchemy.\n\nClientes Web dinâmicos e responsivos utilizando JavaScript ou HTML5\n\nPadrões de Projeto e Arquiteturais aplicados a sistemas Web como MVC; Princípios avançados de projeto orientado a objetos tais como os princípios SOLID",
        "dependencies": []
    },
    {
        "code": "MAC0485",
        "name": "Implicações Sociais da Computação",
        "credits": "2",
        "wcredits": "2",
        "summary": "[1] Introdução à ética e aos impactos sociais em computação: Ética. Filosofia e ética da tecnologia. O papel do programador e o papel do computador. [2] Coleta de dados e privacidade: O que é privacidade? Privacidade de dados e big data. [3] Viés algorítmico: Mathwashing. Estudos de caso. Loops de feedback.\nJustiça, accountability e transparência - o direito à explicação. [4] Tecnologia e política: Democracia, liberdade e tecnologia. Capitalismo de vigilância. Tecnologia como vetor p[5] Autoria e propriedade intelectual: Propriedade intelectual. Software livre e código aberto. Copyright e copyleft. [6] Ética profissional: Diversidade e representatividade. Códigos de conduta.",
        "dependencies": []
    },
    {
        "code": "MAC0546",
        "name": "Fundamentos da Internet das Coisas",
        "credits": "4",
        "wcredits": "0",
        "summary": "Introdução à Internet das Coisas e seu panorama atual: Uma visão da área do ponto de vista acadêmico e empresarial; Obtenção de dados em IoT: Sensores (temperatura, luminosidade, presença), APIs e dados abertos; Conectando coisas: Microcontroladores (Arduino), Microprocessadores (Raspberry Pi), Web Services, Cloud Services; Protocolos de rede e Internet para aplicações em IoT: Bluetooth, WiFi, MQTT, CoAP; Tratamento de dados de sensores: Filtros, fusão de sensores, e aprendizado de máquina; Segurança e privacidade em nível de IoT; Desenvolvimento de aplicações para cidades inteligentes.",
        "dependencies": [
            "MAC0216"
        ]
    },
    {
        "code": "MAC0328",
        "name": "Algoritmos em Grafos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Conexão de grafos: componentes, grafos biconexos. Digrafos fortemente conexos (algoritmo de Kosaraju-Sharir, algoritmo de Tarjan) Emparelhamentos máximos em grafos bipartidos. Emparelhamentos em grafos arbitrários (algoritmo de Edmonds). Fluxo máximo (algoritmo de Ford-Fulkerson). Coloração de vértices. Circuitos hamiltonianos. Tópicos opcionais: link analysis, network analysis, redes aleatórias.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0414",
        "name": "Autômatos, Computabilidade e Complexidade",
        "credits": "4",
        "wcredits": "0",
        "summary": "Palavras, linguagens, operações sobre linguagens. Linguagens regulares. Autômatos finitos determinísticos e não determinísticos. Teorema de Kleene. Autômatos reduzidos. Modelos de computação; máquinas de Turing. Tese de Church. Redutibilidade e problemas indecidíveis. Complexidade, problemas decidíveis em tempo polinomial. Não-determinismo versus determinismo. Redutibilidade e problemas NP-completos. Teorema de Cook-Levin.",
        "dependencies": [
            "MAC0338"
        ]
    },
    {
        "code": "MAC0315",
        "name": "Otimização Linear",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Introdução: Modelagem de problemas de otimização linear. Representação gráfica e solução gráfica. 2. Geometria de otimização linear: Poliedros e conjuntos convexos. Pontos extremos, vértices e soluções viáveis básicas. Poliedros no formato padrão. Degenerescência. Existência de pontos extremos. Otimalidade de pontos extremos. 3. O método Simplex: Condições de otimalidade. Desenvolvimento do método Simplex. Implementação do método Simplex (implementação trivial, Simplex Revisado e tableau). Anti-ciclagem: ordem lexicográfica e regra de Brand. Encontrando uma solução viável básica inicial. 4. Dualidade: O problema dual. O teorema de dualidade. Variáveis duais ótimas como custos marginais. Problemas no formato padrão e o método Simplex Dual. 5. Análise de sensibilidade.",
        "dependencies": [
            "MAT0122"
        ]
    },
    {
        "code": "MAC0325",
        "name": "Otimização Combinatória",
        "credits": "4",
        "wcredits": "0",
        "summary": "O escopo da otimização combinatória e programação inteira. Modelagem de vários problemas usando variáveis 0/1. O problema do transporte. Especialização do método simplex para redes. Aplicações: teorema de Hall, teorema de König, teorema de Dilworth. O problema do transporte capacitado: o método primal-dual. Algoritmos para fluxos máximos em redes. Fluxos de custo mínimo e circulações viáveis: o método \"out-of-kilter\". Estudo aprofundado de poliedros de alguns problemas não-unimodulares bem resolvidos (emparelhamentos, branchings, etc.).",
        "dependencies": [
            "MAC0121",
            "ou",
            "MAC0315"
        ]
    },
    {
        "code": "MAC0327",
        "name": "Desafios de Programação",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. problemas matemáticos envolvendo conceitos de teoria dos números e/ou combinatória;\n2. problemas com vetores, matrizes e strings;\n3. recorrências e recursão;\n4. problemas envolvendo ordenação e busca;\n5. problemas com filas e pilhas;\n6. problemas com grafos e árvores;\n7. busca em largura e busca em profundidade;\n8. estratégia gulosa;\n9. programação dinâmica;\n10. backtracking.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0331",
        "name": "Geometria Computacional",
        "credits": "4",
        "wcredits": "0",
        "summary": "Triangulação de polígonos: teoria, primitivas geométricas, problemas de galeria de arte, algoritmos, questões de implementação. Particionamento de polígonos: particionamento em polígonos monótonos, trapezoidalização de polígonos, particionamento em polígonos convexos. Fecho convexo no plano: algoritmo embrulho-para-presente, algoritmo Quickhull, algoritmo de Graham, algoritmo incremental, algoritmo de divisão-e-conquista, cota inferior. Fecho convexo tridimensional: poliedros, politopos regulares, fórmula de Euler, estruturas de dados, primitivas geométricas, algoritmo embrulho-para-presente. Diagrama de Voronoi: propriedades, diagrama de Delaunay, cota inferior, primitivas geométricas, algoritmo quadrático, algoritmo de divisão-e-conquista. Problemas de localização e intersecção: localização de pontos em polígonos, intersecção de polígonos convexos, intersecção de semiplanos, núcleo de um polígono. Problemas de proximidade: problema do par-mais-próximo, árvore geradora mínima. Arranjos de retas no plano. Ladrilhamentos no Rd.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0336",
        "name": "Criptografia para Segurança de Dados",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Métodos classicas de criptologia, tais como sistemas mono e polialfabético e sistemas rotores. Criptoanálise utilizando técnicas da estatística e da álgebra linear. 2. Teoria da informação; entropia. 3. Data Encryption Standard (DES) e Advanced Encryption Standard (AES). 4. Outros métodos modernos baseados na intratabilidade computacional do problema da mochila e da fatoração de números. 5. Sistemas de distribuição de chaves públicas e secretas. 6. Assinatura digital e autenticação.",
        "dependencies": [
            "MAC0105"
        ]
    },
    {
        "code": "MAC0385",
        "name": "Estruturas de Dados Avançadas",
        "credits": "4",
        "wcredits": "0",
        "summary": "Serão escolhidos tópicos da seguinte lista: 1. Ancestral comum mais próximo, ancestral de nível, árvores de segmentos. 2. Estruturas de dados temporais: persistência e retroatividade. 3. Estruturas de dados cinéticas. 4. Conjectura da otimalidade dinâmica. 5. Conexidade em grafos dinâmicos. 6. Busca de padrão em textos gigantes. 7. Estruturas de dados sucintas. 8. Hierarquia de memória.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0450",
        "name": "Algoritmos de Aproximação",
        "credits": "4",
        "wcredits": "0",
        "summary": "\"Recapitulação de resultados básicos sobre grafos, complexidade computacional e probabilidade. Métodos de projeto de algoritmos de aproximação: métricos, de arredondamento, probabilísticos, baseados em programação linear e semidefinida, primais-duais. Algoritmos de aproximação para problemas de escalonamento, bin packing, projeto de redes e otimização em grafos. Complexidade computacional: classes de complexidade Max SNP e APX, reduções, alguns resultados de inaproximabilidade.",
        "dependencies": [
            "MAC0315"
        ]
    },
    {
        "code": "MAC0465",
        "name": "Biologia Computacional",
        "credits": "4",
        "wcredits": "0",
        "summary": "Comparação de seqüências e suas variações. Busca de seqüências em base de dados. Árvores filogenéticas. Sequenciamento e Montagem. Rearranjo de Genomas. Predição de estruturas moleculares.Aplicações de chips de DNA.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0466",
        "name": "Teoria dos Jogos Algorítmica",
        "credits": "4",
        "wcredits": "0",
        "summary": "Jogos, estratégias, funções custo e utilidade. Equilibrio de Nash. Custo social. Preço da estabilidade e da anarquia. Complexidade de encontrar um equilíbrio de Nash. Balanceamento de carga. Projeto algorítmico de mecanismos. Leilões combinatórios. Jogos de roteamento. Jogos de formação de redes.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0320",
        "name": "Introdução à Teoria dos Grafos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Grafos. Isomorfismo. Caminhos e circuitos. Subgrafos. Cortes e pontes. Grafos conexos. Árvores. Grafos aresta-biconexos. Grafos bipartidos. Grafos eulerianos. Grafos hamiltonianos. Emparelhamentos em grafos bipartidos. Conjuntos estáveis e cliques. Coloração de arestas. Coloração de vértices. Noções de planaridade.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAT0206",
        "name": "Análise Real",
        "credits": "6",
        "wcredits": "0",
        "summary": "1. Números reais: introdução axiomática. Sequências numéricas. Limites superior e inferior. Sequências     de Cauchy. Sequências limitadas e monótonas limitadas. Intervalos encaixantes. 2. Continuidade: teoremas do     anulamento, do máximo e do mínimo, preservação da conexidade. Continuidade por sequências. Continuidade     uniforme. 3. Derivabilidade: diferencial e teorema do valor médio. 4. Integral de Riemann: definição e exemplos     especiais. Integrabilidade de funções contínuas e teorema fundamental do Cálculo. Critérios de integrabilidade.     5. Séries numéricas: critérios de convergência. 6. Sequências e séries de funções convergência pontual e uniforme,     teste-M de Weierstrass. Continuidade, integrabilidade e derivabilidade com convergência uniforme. 7. Séries de     potências e propriedades.",
        "dependencies": [
            "MAT2454"
        ]
    },
    {
        "code": "MAT0264",
        "name": "Anéis e Corpos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Anéis, homomorfismos, ideais, anel quociente, domínios de integridade, corpos de frações.2. Anéis fatoriais, domínios de ideais principais, domínios euclidianos.3. Anéis de polinômios.4. Extensões de corpos.5. Construções com régua e compasso.",
        "dependencies": [
            "MAC0105"
        ]
    },
    {
        "code": "MAC0436",
        "name": "Tópicos de Matemática Discreta I",
        "credits": "4",
        "wcredits": "0",
        "summary": "O ministrante selecionará os principais tópicos a serem cobertos dentre os seguintes: \nAplicações de funções geradoras, incluindo aplicações a problemas de enumeração. \nTópicos da teoria dos números. \nAspectos combinatórios da geometria e, em particular, politopos e cones.",
        "dependencies": []
    },
    {
        "code": "MAE0326",
        "name": "Aplicações de Processos Estocásticos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1.\tModelo de filas.2.\tModelos com muitas/infinitas componentes.3.\tSimulação de processos estocásticos (método de Monte Carlo via Cadeias de Markov).4.\tConfiabilidade.5.\tInferência em processos estocásticos.6.\tOutras aplicações recentes.",
        "dependencies": [
            "MAE0228"
        ]
    },
    {
        "code": "MAT0225",
        "name": "Funções Analíticas",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Séries de potências e funções elementares. 2. Derivação complexa. 3. Integração complexa, fórmula     de Cauchy, fórmula integral para as derivadas; teorema do máximo módulo, teorema de Liouville. 4. Séries de Taylor e     Laurent, domínio de convergência e classificação de singularidades. 5. Resíduos, aplicações. Transformação conforme.",
        "dependencies": [
            "MAT0236",
            "ou",
            "MAT0206",
            "MAT0236"
        ]
    },
    {
        "code": "MAT0234",
        "name": "Medida e Integração",
        "credits": "4",
        "wcredits": "0",
        "summary": "1) Medida de Lebesgue em R^n. 2) Espaços de medida; funções mensuráveis e integração; Lema de Fatou; Teorema da convergência monótona; Teorema de convergência dominada. 3) A relação da integral de Lebesgue na reta com a integral de Riemann e com a integral imprópria de Riemann. 4) Aplicação do teorema de convergência dominada: derivação sob o sinal de integral. 5) Espaços L^p; desigualdades de Hölder e Minkowski; completude dos espaços L^p. 6) Teoremas de Fubini e Tonelli para medida de Lebesgue em R^n. 7) Tópicos opcionais (ao menos um desses tópicos deve ser abordado): a) Transformada de Fourier; produto de convolução; aplicações a EDP. b) Teorema de Vitali; funções de variação limitada; funções absolutamente contínuas e teorema fundamental do cálculo. c) Teorema de mudança de variável para integrais de Lebesgue em R^n.",
        "dependencies": [
            "MAT0236",
            "ou",
            "MAT0206",
            "MAT0236"
        ]
    },
    {
        "code": "MAT0265",
        "name": "Grupos",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Grupos, subgrupos, classes laterais, Teorema de Lagrange, subgrupo normal, grupo quociente, homomorfismo de grupos.2. Grupos de permutações.3. Grupos de matrizes.4. Ações.5. Grupos de rotações finitos.6. Teoremas de Sylow.7. Grupos abelianos finitos.8. Tópico livre.",
        "dependencies": [
            "MAC0105"
        ]
    },
    {
        "code": "MAT0311",
        "name": "Cálculo Diferencial e Integral V",
        "credits": "6",
        "wcredits": "0",
        "summary": "1. Topologia de Rn e espaços métricos (abertos, fechados, vizinhanças, pontos de acumulação,     compactos, conexos). Caracterização de compacto de Rn como fechado e limitado. 2. Seqüências em espaços     métricos. Convergência. Subseqüências. Caracterização da topologia (aberto, fechado, ponto de acumulação) por     seqüências. relação entre compacto e seqüencialmente compacto. Seqüência de Cauchy. Completude. Destaque para     o Rn. 3. Continuidade de aplicações de Rn em Rm e entre espaços métricos. Caracterização de continuidade por     seqüências. Continuidade de função composta. Preservação de compactos e de conexos. 4. Transformações de Rn     em Rm; Diferenciabilidade, teoremas de existência da diferencial, regra da cadeia e desigualdade do valor médio. A     classe C1. 5. Teorema da função inversa e teorema da função implícita. Aplicações. 6. Derivadas de ordem superior.     Polinômio de Taylor. Máximos e mínimos. 7. Máximos e mínimos condicionados. Multiplicadores de Lagrange.",
        "dependencies": [
            "MAT0122",
            "MAT0206"
        ]
    },
    {
        "code": "MAC0690",
        "name": "Tópicos em Combinatória Contemporânea I",
        "credits": "4",
        "wcredits": "0",
        "summary": "Aspectos fundamentais de várias áreas da combinatória moderna, incluindo as áreas de combinatória extremal e combinatória probabilística.  Aspectos básicos das estruturas aleatórias e pseudo-aleatórias e o lema de regularidade de Szemerédi.  Técnicas algébricas e técnicas analíticas, com ênfase em técnicas da análise harmônica.  Tópicos em combinatória aditiva.",
        "dependencies": [
            "MAC0105",
            "MAC0338",
            "MAE0119",
            "MAT0122",
            "MAT0236"
        ]
    },
    {
        "code": "MAC0691",
        "name": "Tópicos na Teoria Algébrica dos Grafos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Tópicos fundamentais na área da teoria algébrica dos grafos, incluindo teoria espectral dos grafos, álgebra linear avançada, transformadas discretas de Fourier e tópicos de geometria combinatória. Estudo dos autovalores e autovetores da matriz Laplaciana e da matriz de adjacência de um grafo, e possíveis aplicações.",
        "dependencies": [
            "MAT0122"
        ]
    },
    {
        "code": "MAC0775",
        "name": "Métodos Probabilísticos em Combinatória e em Teoria da Computação I (",
        "credits": "4",
        "wcredits": "0",
        "summary": "Fundamentos da teoria elementar de probabilidades. Aplicações clássicas do primeiro e segundo momentos;   linearidade da esperança e o método da alteração. O lema local. Breve discussão sobre desigualdades de correlação. Desigualdades para grandes desvios e o fenômeno da concentração da medida: desigualdades elementares, o método das diferenças limitadas, as desigualdades de Janson; discussão sobre as desigualdades de Talagrand e Kim e Vu. \nElementos de grafos aleatórios e pseudo-aleatoriedade. Aplicações em várias áreas, incluindo, entre outros, teoria dos grafos e hipergrafos, geometria, teoria dos números, teoria da complexidade e algoritmos.",
        "dependencies": [
            "MAC0105",
            "MAC0338",
            "MAE0119",
            "MAT0122",
            "MAT0236"
        ]
    },
    {
        "code": "MAC0776",
        "name": "Métodos Probabilísticos em Combinatória e em Teoria da Computação II",
        "credits": "4",
        "wcredits": "0",
        "summary": "Tópicos em grafos aleatórios e pseudo-aleatoriedade. O lema de regularidade de Szemerédi e suas variantes; aplicações em combinatória e em complexidade computacional (testabilidade de propriedades).  Construções explícitas e desaleatorização em combinatória e em teoria da complexidade. Os seguintes tópicos serão vistos com a profundidade apropriada para cada turma, dependendo dos interesses específicos. Entropia.  Discrepância. Jogos posicionais. Técnicas de análise harmônica. Noções de classes de complexidade probabilísticas; relações com as classes de complexidade clássicas e sistemas interativos de provas.",
        "dependencies": [
            "MAC0775"
        ]
    },
    {
        "code": "MAC0300",
        "name": "Métodos Numéricos da Álgebra Linear",
        "credits": "4",
        "wcredits": "0",
        "summary": "Eliminação Gaussiana e variantes: Sistemas de equações lineares. Sistemas triangulares. Sistemas definidos positivos, decomposição de Cholesky. Eliminação Gaussiana e decomposição LU. Eliminação Gaussiana com pivoteamento. Sensibilidade de sistemas lineares: Normas de matrizes e vetores. Número de condição. Análise do erro de arredondamento. Eliminação Gaussiana com matrizes mal condicionadas. Escalamento. Refinamentos iterativos. Matrizes ortogonais e o problema de quadrados mínimos: O problema de quadrados mínimos discreto. Matrizes ortogonais, rotações e reflexões. Solução do problema de quadrados mínimos. Vetores ortonormais e o método de Gram-Schimdt. Sensibilidade do problema de quadrados mínimos. Autovalores e autovetores: Propriedades básicas. O método da potência e algumas extensões simples. Transformações de similaridade. Reduções à forma Hessenberg e triangular. Algoritmo QR. Decomposição em valores singulares: Cálculo da decomposição SVD. Algumas aplicações básicas de valores singulares.",
        "dependencies": [
            "MAT0122"
        ]
    },
    {
        "code": "MAC0343",
        "name": "Otimização Semidefinida e Aplicações",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Decomposição espectral e matrizes positivas semidefinidas; 2. Formulações de programas semidefinidos; 3. Dualidade de programas semidefinidos; 4. Complexidade computacional para solução de programas semidefinidos; 5. Aplicações à otimização combinatória: relaxações de problemas 0-1, algoritmos de aproximação (MAXCUT, Max-2Sat, etc.), conjuntos independentes e o número teta de Lovász; 6. Hierarquias de programação semidefinida para politopos 0-1; 7. Aplicações a códigos binários: o limitante de Delsarte e o uso de simetria em problemas de programação semidefinida; 8. Somas de quadrados e polinômios positivos; otimização polinomial.",
        "dependencies": [
            "MAC0315"
        ]
    },
    {
        "code": "MAC0418",
        "name": "Tópicos Especiais de Programação Matemática",
        "credits": "4",
        "wcredits": "0",
        "summary": "Introdução à programação dinâmica: controle de estoque e problemas de caminho crítico.Programação linear mista: métodos branch and bound, problema da mochila aplicado a problemas de corte e de expansão de sistemas.Linearização. Problemas não lineares: linearização por trechos e caso diferenciável: aplicação a fluxos não lineares.",
        "dependencies": []
    },
    {
        "code": "MAC0419",
        "name": "Métodos de Otimização em Finanças",
        "credits": "4",
        "wcredits": "0",
        "summary": "Probabilidade: interpretação freqüentista; interpretação Bayesiana; axiomatização; inferência; verossimilhança; esperança; variância; covariância; correlação; teoria da utilidade. Programação Linear: convexidade; poliedros, faces; algoritmo simplex; dualidade; problemas paramétricos. Programação Quadrática: multiplicadores de Lagrange; complementaridade linear; problemas paramétricos. Modelos tipo Markowitz: análise de média variância; distribuição das taxas de retorno; fronteira eficiente; modelo de Tobim e Brennan; modelos de índices; ativos sintéticos; modelos de equilíbrio; modelos CAPM e APT. Programação Dinâmica: equações de evolução; problemas determinísticos em grafos; controle ótimo de cadeias de Markov; controle linear quadrático Gaussiano; filtros de Kalman, adaptativos e evanescentes. Classificação: Reconhecimento de padrões; significância estatística e generalização; regularização; árvores de classificação; modelos de misturas. Teste de Hipótese: Princípio da verossimilhança; Invariância; Onus Probandi; evidência contra a hipótese; seleção de modelos.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0427",
        "name": "Otimização Não Linear",
        "credits": "4",
        "wcredits": "0",
        "summary": "Introdução: Definições básicas. Existência e unicidade de solução: Resultados em otimização convexa e em conjuntos compactos. Otimização sem restrições: Condições de otimalidade. Métodos de Cauchy, Newton e Quasi-Newton. Globalização: Busca linear. Regiões de confiança. Otimização com restrições de igualdade e desigualdade: Restrições lineares. Métodos de restrições ativas. Condições de otimalidade. Métodos de penalidades.",
        "dependencies": [
            "MAT0122"
        ]
    },
    {
        "code": "MAC0452",
        "name": "Tópicos de Otimização Combinatória I",
        "credits": "4",
        "wcredits": "0",
        "summary": "O ministrante selecionará os principais tópicos a serem cobertos dentre os seguintes. Otimização inteira, otimização semidefinida, técnicas poliédricas, algoritmos sobre redes, algoritmos de aproximação, algoritmos parametrizados.",
        "dependencies": [
            "MAC0325"
        ]
    },
    {
        "code": "MAC0461",
        "name": "Introdução ao Escalonamento e Aplicações",
        "credits": "4",
        "wcredits": "0",
        "summary": "Introdução: notações, representação e conceitos. Apresentação de alguns problemas clássicos de escalonamento. Noções de complexidade. Escalonamento em uma única máquina. Escalonamento em máquinas paralelas. Escalonamento com atraso de comunicação. Escalonamento dinâmico.",
        "dependencies": []
    },
    {
        "code": "MAC0473",
        "name": "Otimização Inteira",
        "credits": "4",
        "wcredits": "0",
        "summary": "Problemas de otimização inteira e técnicas de formulação. Formulações exatas via programação linear, matrizes totalmente unimodulares. Planos de cortes. Os métodos \"branch-and-bound\" e \"branch-and-cut\". Geração de colunas e pricing. Relaxação de Lagrange. Formulações estendidas e projeções (lift-and-project).",
        "dependencies": [
            "MAC0315"
        ]
    },
    {
        "code": "MAC0317",
        "name": "Introdução ao Processamento de Sinais Digitais",
        "credits": "4",
        "wcredits": "0",
        "summary": "Representação digital de sinais: amostragem, quantização e \"\"aliasing\"\". Transformada Discreta de Fourier e FFT (1D e 2D). Transformada Discreta do Cosseno e compressão de sinais. Convolução, filtros, Transformada z e aplicações: remoção de ruído e detecção de bordas. Janelamento no tempo e espaço e localização. Bancos de filtros e técnicas de análise-ressíntese com reconstrução perfeita. Transformada Wavelet Discreta.",
        "dependencies": []
    },
    {
        "code": "MAC0426",
        "name": "Sistemas de Bancos de Dados",
        "credits": "4",
        "wcredits": "0",
        "summary": "Fundamentos da arquitetura dos sistemas gerenciadores de bancos de dados relacionais: armazenamento e indexação dos dados; processamento e otimização de consultas; gerenciamento de transações, controle de concorrência e recuperação de falhas. Dados semiestruturados (por exemplo, XML e JSON); linguagens de consulta para dados semiestruturados. Bancos de dados paralelos e distribuídos: noções básicas e processamento de transações distribuídas (protocolo three-phase commit). Introdução a bancos de dados não relacionais, seus modelos de dados e suas implementações: bancos de dados chave-valor; bancos de dados orientados a colunas; bancos de dado orientados a documentos; bancos de dados orientados a grafos. Novas tecnologias para gerenciamento de dados em grande escala.",
        "dependencies": [
            "MAC0350"
        ]
    },
    {
        "code": "MAC0460",
        "name": "Introdução ao aprendizado de máquina",
        "credits": "4",
        "wcredits": "0",
        "summary": "- Conceitos básicos de aprendizado de máquina\n- Tipos de aprendizado\n- Espaço de hipóteses\n- Complexidade do espaço de hipóteses\n- Complexidade do aprendizado\n- Função de perda\n- Erro e ruído\n- Algoritmos de aprendizado \n- Avaliação de classificadores por treinamento, validação e teste\n- Modelos lineares: regressão logística e perceptron\n- Redes neurais\n- Máquinas de vetores de suporte\n- Regularização \n- Transformações não lineares (métodos de kernel e função de base radial)\n- Navalha de Occam\n- Viés de amostragem\n- Análise exploratória de dados.",
        "dependencies": [
            "MAE0119",
            "MAT0122",
            "MAT2454"
        ]
    },
    {
        "code": "MAE0580",
        "name": "Introdução à aprendizagem estatística",
        "credits": "4",
        "wcredits": "0",
        "summary": "1. Introdução: identificação de padrões, classificação e predição em sequências de matrizes. O problema do aprendizado supervionado e não supervisionado.\n\n2. Modelos probabilísticos básicos: cadeias estocásticas com memória de alcance variável, cadeias de Markov ocultas, campos aleatórios de Markov, grafos aleatórios, modelos de Ising e estados de Gibbs.\n\n3. Ferramentas básicas: método de Monte Carlo markoviano, amostrador de Gibbs.\n\n4. Seleção estatística de modelos. Algoritmo Contexto. Máxima verossimilhança penalizada, critérios AIC e BIC. A navalha de Ockam e o princípio MDL. A heurística da inclinação.\n\n5. Redes neurais. O algoritmo \"Deep Learning\".\n\n7. Modelos gráficos e redes bayesianas. Identificação de grafos de interação entre componentes",
        "dependencies": []
    },
    {
        "code": "MAC0219",
        "name": "Programação Concorrente e Paralela",
        "credits": "4",
        "wcredits": "0",
        "summary": "Conceitos básicos: processos, threads, interrupções, escalonamento\nProblemas de programação concorrente: deadlock, alocação de recursos,\nLeitura e escrita concorrente, exclusão mútua, consenso.\nProgramação concorrente em UNIX. Semáforos, mutexes e monitores.\nOtimização sequencial: uso eficiente da memória, unit stride, blocking;\nInstruções vetoriais e super escalares, opções de otimização.\nProfiling e modelagem de desempenho\nControle de processos e paralelização fork-join\nMemória compartilhada e introdução ao OpenMP\nMemória distribuída e MPI\nProgramação em GPUs, CUDA e novas tecnologias\nComputação  paralela na nuvem",
        "dependencies": [
            "MAC0121",
            "MAC0216"
        ]
    },
    {
        "code": "MAC0431",
        "name": "Introdução à Computação Paralela e Distribuída",
        "credits": "4",
        "wcredits": "0",
        "summary": "Problemas e conceitos; tipos e granularidades de paralelismo; arquiteturas de sistemas paralelos e distribuídos; topologias de interconexão; protocolos de comunicação; mecanismos de comunicação e sincronização; linguagens e sistemas de programação; algoritmos paralelos e distribuídos; aplicações.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0218",
        "name": "Técnicas de Programação II",
        "credits": "4",
        "wcredits": "2",
        "summary": "1. Boas práticas metodológicas para desenvolvimento de software de forma colaborativa e ferramentas de gestão de projetos. \n2. Orientação a objetos: encapsulamento, herança, polimorfismo, interfaces, tratamento de exceções. \n3. Arcabouços orientados a objetos para construção de sistemas web. Introdução a HTTP, HTML, CSS e JavaScript. \n4. Padrões de projeto de software.  \n5. Técnicas avançadas de teste de software incluindo arcabouços para automatização de testes e boas práticas de codificação baseadas em testes. Test-driven development (TDD) e Behavior-Driven Development (BDD). \n6. Qualidade e estética de código e refatoração. \n7. Noções de implantação na nuvem e contêineres.",
        "dependencies": [
            "MAC0216"
        ]
    },
    {
        "code": "MAC0332",
        "name": "Engenharia de Software",
        "credits": "4",
        "wcredits": "2",
        "summary": "Conceituação de Engenharia de Software.\n\nModelos de ciclos de vida.\n\nParadigmas de Desenvolvimento.\n\nProcessos de Desenvolvimento.\n\nAgilidade no desenvolvimento de software.\n\nGerenciamento de Projetos.\n\nFerramentas de Trabalho.\n\nAnálise e especificação de requisitos.\n\nModelagem.\n\nProjeto (design).\n\nModularidade.\n\nPadrões de projeto.\n\n Reúso.\n\nArquitetura de Software.\n\nProjeto da interface com o usuário.\n\nImplementação e implantação.\n\nVerificação e validação: testes, revisões e inspeções.\n\nMétodos formais.\n\nGerenciamento de versões e configurações.\n\nManutenção e evolução de software.\n\nPlanejamento e Estimativas.\n\nDocumentação.\n\nQualidade e métricas.\n\nSoftware livre.\n\nEngenharia de Software para sistemas Web.\n\nTópicos atuais de Engenharia de Software.\n\nA Pesquisa e o futuro da Engenharia de Software.",
        "dependencies": [
            "MAC0350"
        ]
    },
    {
        "code": "MAC0346",
        "name": "Programação para Jogos Digitais",
        "credits": "4",
        "wcredits": "2",
        "summary": "Fundamentos: arquitetura de jogos, motores de jogos e linha de produção de jogos. Estrutura básica de um jogo: game loop, subsistemas, máquina de estados, gerenciamento de recursos e data-driven design. Interação com usuário: renderização gráfica, animação, renderização sonora e dispositivos de interface humana (controles, joysticks, etc.). Simulação do mundo virtual: modelo de objetos; simulação de física; outras regras da simulação e scripting. Sistemas avançados: conexão via rede, ferramentas de desenvolvimento e depuração, programação assíncrona em jogos e inteligência artificial.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0413",
        "name": "Tópicos Avançados de Programação Orientada a Objetos",
        "credits": "4",
        "wcredits": "2",
        "summary": "• Linguagens fortemente tipadas vs. Linguagens dinâmicas.\n• Como características avançaadas como Reflexão Metaprogramação, Continuações\ne Traits facilitam o desenvolvimento de sistemas flexíveis, enxutos\ne robustos.\n• Linguagens de Padrões e escrita de Padrões.\n• Padrões arquiteturais, padrões de análise e outros tipos de padrões para projeto\ne desenvolvimento de software OO.\n• Relação entre OO e desenvolvimento ágil de software: TDD, BDD e gestão de\narquiteturas OO de alto nível.\n• Estilos de codificação e beleza de código OO.\n• Arcabouços Orientados a Objetos\n• Princípios avançaados de projeto orientado a objetos tais como os princípios\nSOLID\n• Programação Orientada a Aspectos.",
        "dependencies": [
            "MAC0218",
            "MAC0316"
        ]
    },
    {
        "code": "MAC0467",
        "name": "Empreendedorismo Digital",
        "credits": "4",
        "wcredits": "2",
        "summary": "O empreendedorismo de um povo tem um papel importante no desenvolvimento econômico e social de um país. No século 21, com a consolidação da era do conhecimento, o empreendedorismo de natureza tecnológica, em particular aquele relacionado ao software e negócios em torno da internet tem se tornado cada vez mais importante. Esta disciplina propicia ao aluno um primeiro contato com conceitos e técnicas relacionadas ao empreendedorismo de modo a facilitar o entendimento dos desafios que se colocam na área. Como resultado, espera-se incentivar o espírito empreendedor daqueles alunos que desejem envolver-se em inovação tecnológica.\n\n1. Empreendedorismo em startups, pequenas e grandes empresas, governo e ONGs.\n2. Métodos ágeis de desenvolvimento de software e técnicas de programação para inovação tecnológica\n3. Engenharia de startups: startup enxuta, desenvolvimento de clientes e desenvolvimento de produtos\n4. Uso de software livre por startups e startups de software livre\n5. Ecossistema do empreendedorismo e o perfil empreendedor\n6. Ambiente institucional e legal para empresas no Brasil\n7. Modelos de Negócio\n8. Planos de Negócio\n9. Financiamento público e privado\n10. Propriedade intelectual e patentes\n11. Sustentabilidade e empreendedorismo social\n12. O papel do empreendedorismo na sociedade e economia",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0470",
        "name": "Desenvolvimento de Software Livre",
        "credits": "4",
        "wcredits": "2",
        "summary": "O modelo de desenvolvimento colaborativo de software conhecido como Software Livre tem se mostrado capaz de produzir sistemas e aplicações de software de excelente qualidade. Na última década, as ferramentas e sistemas de software livre passaram a constituir uma plataforma robusta a partir da qual a indústria de TI pode construir e oferecer os seus serviços. Este modelo aberto e colaborativo de produção apresenta uma série de vantagens para uma grande gama de empreendimentos de desenvolvimento de software, tanto acadêmicos quanto comerciais. Esta disciplina irá expor os alunos à comunidade do software livre e suas ferramentas, às vantagens e desvantagens desse modelo bem como aos desafios a serem enfrentados por aqueles que o adotam, além dos seus desdobramentos sociais e culturais. Dessa forma, os alunos estarão melhor preparados a participar de projetos de desenvolvimento de software livre.\n\nOs tópicos abordados na disciplina são os seguintes:\n\nHistória do Software Livre: o movimento pelo Software Livre (\"\"Free Software\"\") e o movimento pelo Código Aberto (\"\"Open Source\"\"), a FSF e a OSI.\nAspectos jurídicos de software livre: a legislação brasileira de propriedade intelectual, copyright, licenças, compatibilidades e incompatibilidades.\nComunidades de software livre: formas de organização e participação, gerenciamento de contribuições, atratividade de projetos e forks.\nModelos de negócio e empreendedorismo com software livre.\nFerramentas de gestão e desenvolvimento colaborativo de projetos.\nO paradigma de colaboração do git.\nAmbiente de desenvolvimento: distros, pacotes, virtualização e devops.\nBoas práticas de codificação, estilo e padronização de código.\nMétodos Ágeis e Software Livre.\nTestes e integração contínua (xUnit, Selenium, Cruise Control, etc.).\nDocumentação e usabilidade.\nDesdobramentos sociais: Cultura Livre, Ciência Livre, Creative Commons e os impactos social e econômico do Software Livre.\nHardware Livre.\nAvaliação de qualidade de projetos de software livre.\nDesafios para o futuro do software livre: DRM, patentes, interoperabilidade, viés social e de gênero.\n\nOs estudantes terão contato com este material através de aulas teóricas, debates sobre tópicos específicos e seminários. Em grupos de 2 a 5 alunos, será também desenvolvido um projeto de duração de 12 semanas onde espera-se uma real contribuição a um projeto existente de software livre; esta contribuição pode ser na forma de nova documentação, novas funcionalidades ou consertos de erros e melhorias.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0472",
        "name": "Laboratório de Métodos Ágeis",
        "credits": "4",
        "wcredits": "2",
        "summary": "• O Manifesto Ágil. Os princípios e valores dos métodos ágeis.\n• As Práticas de XP. As doze práticas iniciais. As práticas principais e corolárias atuais.\n• Testes Automatizados. Como fazer e ferramentas mais usadas.\n• Refatoração: técnicas sistemáticas para melhorar o desenho de software pré-\nexistente.\n• Planejamento Ágil. Cartões de histórias, estimativas e priorização. \n• Padronização de Estilo.\n• Ferramentas para Desenvolvimento Colaborativo de Software. Incluindo ferramentas de integração contínua e ferramentas de avaliação da qualidade do software.",
        "dependencies": [
            "MAC0218"
        ]
    },
    {
        "code": "MAC0475",
        "name": "Laboratório de Sistemas Computacionais Complexos",
        "credits": "4",
        "wcredits": "2",
        "summary": "Métodos ágeis (valores, princípios e práticas), DevOps (entrega contínua, versionamento, trunk-based development, automação de testes), sistemas distribuídos (teorema CAP, consistência forte e eventual, níveis de disponibilidade), padrões arquiteturais (camadas, microkernel, microsserviços, baseada em eventos, nuvem), princípios arquiteturais (aplicações com 12 fatores, sistemas reativos, sistemas nativos à nuvem), tecnologias web fundamentais (HTML, CSS, JavaScript), modelo requisição-resposta (ad hoc, REST, GraphQL), desenvolvimento para front-end e modelos de páginas (MPA, SPA, SSR, PWA), desenvolvimento para back-end e padrões arquiteturais (MVC, MVP, MVVM, JAM), autenticação (identificadores sequenciais, UUID, tokens, JWT) e autorização (protocolos de controle de acesso), banco de dados (relacionais, não relacionais, mensageiros), infraestrutura (virtualização, conteinerização, orquestração e coreografia, malha de serviços) e plataformas de entrega (IaaS, PaaS, CDN, serverless).",
        "dependencies": [
            "MAC0350"
        ]
    },
    {
        "code": "MAC0344",
        "name": "Arquitetura de Computadores",
        "credits": "4",
        "wcredits": "0",
        "summary": "• Conceitos básicos de arquitetura.\n\n• Histórico dos computadores e gerações.\n\n• Desempenho: pipeline, risc, instruções superescalares, multicore\n\n• Memória cache, tipos e implementações.\n\n• Estrutura interna da memória: DRAM, SDRAM, Flash, correção de erros.\n\n• Memória externa: discos magnéticos, estado sólido, discos  ́oticos, RAID\n\n• Paginação e segmentação, TLBs, memória virtual.\n\n• Instruções de máquina, RISC e CISC, execução fora de ordem, modos de endereçamento, interrupções e proteção.",
        "dependencies": [
            "MAC0121",
            "MAC0329"
        ]
    },
    {
        "code": "MAC0352",
        "name": "Redes de Computadores e Sistemas Distribuídos",
        "credits": "4",
        "wcredits": "0",
        "summary": "Arquitetura de redes: modelos em camadas e protocolos, o modelo da Internet.\nAplicações e protocolos para Multimídia.\nO argumento fim-a-fim.\nProgramação através de soquetes em C e em linguagens orientadas a objetos.\nNomes, endereçamento e roteamento na Internet.\nA suíte de protocolos TCP/IP, UDP, IP-Multicast.\nProtocolos MAC, Ethernet e endereçamento em redes locais.\nDetecção e correção de erros.\nIPv6.\nSegurança.\nGerenciamento de redes, SNMP.\nRedes P2P.\nAnonimato na Internet (Tor).\nVirtualização de redes.\nComunicação entre processos: cliente-servidor, grupos, RPC.\nServiços web.\nRecuperação e tolerância a falhas.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0463",
        "name": "Computação Móvel",
        "credits": "4",
        "wcredits": "0",
        "summary": "Os principais assuntos estudados serão:\n• Introdução: problemas relacionados à Mobilidade, Tecnologias de Comunicação sem Fio, O conceito de Célula, Arquiteturas de Sistemas, Aplicações;\n• Conceitos Básicos de Sistemas Móveis: Transmissão sem fio, Redes locais sem\nfio, Layout e Capacidade de Células, Alocação de Canais, Transição;\n• Arquiteturas de Software: Modelos de Computação Móvel, Adaptabilidade ao\nAmbiente, Operações desconectadas, Mobilidade de Dados e Código, Agentes\nMóveis, Tolerância a Falhas;\n• Protocolos: IP móvel, Tunelamento, Roteamento, TCP para Computação\nMóvel;\n• Gerenciamento de Informação: Difusão, Modelo Push-Pull, Caching, Difusão\ndinâmica e Consistência;\n• Gerenciamento de Localização: Problemática, Esquema de Duas Camadas,\nCaching por Usuário, Esquemas hierárquicos, Diretórios regionais;\n• Desenvolvimento de aplicativos para dispositivos móveis;\n• Redes Móveis ad-hoc, redes de sensores sem fio. Exemplos, algoritmos de\nroteamento;\n• Apresentação de seminários sobre sistemas e tecnologias móveis atuais.",
        "dependencies": [
            "MAC0323"
        ]
    },
    {
        "code": "MAC0439",
        "name": "Laboratório de Bancos de Dados",
        "credits": "4",
        "wcredits": "2",
        "summary": "Prática da implementação de um banco de dados relacional ou objeto-relacional com seus procedimentos de inserção, remoção, alteração e consulta. \nFerramentas de apoio para o desenvolvimento do projeto conceitual, lógico e físico de bancos de dados.  \nIntrodução e prática de conceitos de gerenciamento de bancos de dados relacionais por meio do uso da linguagem SQL: definição de dados e restrições; modificações de dados (inserção, remoção e alteração); consultas envolvendo junções, união, interseção e diferença de relações; consultas envolvendo agrupamento e agregação;  consultas recursivas;  visões, gatilhos e procedimentos armazenados; segurança, autorização; transações; índices.  \nTécnicas para sintonia fina de banco de dados relacionais.  \nIntegração de bancos de dados a sistemas de software: padrões arquiteturais para o acesso a bancos de dados; arcabouços para persistência em bancos de dados.  \nPrática da implementação de um sistema simples que empregue dados semiestruturados ou um banco de dados não-relacional como solução para o gerenciamento de seus dados.",
        "dependencies": [
            "MAC0350"
        ]
    },
    {
        "code": "MAC0459",
        "name": "Ciência e Engenharia de Dados",
        "credits": "4",
        "wcredits": "0",
        "summary": "Importância da área e de suas aplicações. \nProcesso de descoberta do conhecimento (KDD). \nTratamento, representação e qualificação de grande volumes de dados. \nArmazém de dados e modelos multidimensionais. \nNoções de Redes de Petri e Álgebra de Processos.  \nModelagem e implementação de workflows científicos e processos de negócio. \nIndexação e recuperação de grandes volumes de dados. \nAnálise exploratória de dados. \nRedes complexas e bancos de dados orientado a grafos. \nExercícios com utilização de dados simulados e reais.",
        "dependencies": [
            "MAC0121"
        ]
    },
    {
        "code": "MAC0425",
        "name": "Inteligência Artificial",
        "credits": "4",
        "wcredits": "2",
        "summary": "1. Fundamentos. \n2. Busca heurística. \n3. Busca adversarial. \n4. Representação de conhecimento. \n5. Planejamento clássico. \n6. Raciocínio probabilístico. \n7. Tomada de decisão sob incerteza. \n8. Planejamento probabilístico. \n9. Aprendizado supervisionado e não supervisionado. \n10. Aprendizado por reforço. \n11. Tópicos avançados e problemas atuais.",
        "dependencies": []
    },
    {
        "code": "MAC0318",
        "name": "Introdução à Programação de Robôs Móveis",
        "credits": "4",
        "wcredits": "0",
        "summary": "Robótica Móvel: definição, aplicações e conceitos básicos. Arquiteturas para Robótica Móvel: reativas, deliberativas e híbridas. Os problemas computacionais da Robótica Móvel: navegação, localização e mapeamento. Atuadores e sensores: noções básicas de tipos e características. Principais características da Robótica Móvel inteligente: percepção do ambiente (total ou parcial); efeitos de ações (determinísticos, não-determinísticos ou probabilísticos); características do ambiente (discreto ou contínuo, com consumo e produção de recursos, com restrições de tempo); presença de outros robôs (colaboradores ou adversários); capacidade de planejamento e aprendizagem.",
        "dependencies": []
    },
    {
        "code": "MAC0444",
        "name": "Sistemas Baseados em Conhecimento",
        "credits": "4",
        "wcredits": "0",
        "summary": "Fundamentos da Inteligência Artificial. Resolução de problemas com técnicas de busca. Representação de conhecimento. Raciocínio lógico. Inferência em lógica de predicados de primeira ordem. Provador de teoremas. Construção de bases de conhecimento. Engenharia de conhecimento. Engenharia e uso de ontologias. Programação lógica. Sistemas de produção. Redes semânticas. Aprendizagem de conhecimento. Programação lógica indutiva. Aprendizagem baseada em explicação. Agentes que se comunicam. Processamento de linguagem natural.",
        "dependencies": [
            "MAC0239",
            "MAC0323"
        ]
    },
    {
        "code": "MAT0349",
        "name": "Introdução à Lógica",
        "credits": "4",
        "wcredits": "0",
        "summary": "Breve digressão histórica. Cálculo proposicional. Fórmulas tautológicas, contra-válidas e     indeterminadas. Redução do número de conectivos. Problema de Post. Álgebra dos interruptores. Argumentos     válidos. Teorema da dedução. Axiomatização do cálculo proposicional. Cálculo de predicados. Quantificadores.     Fórmulas. Argumentos. Axiomatização do cálculo de predicados de 1 ordem. Noção sobre teorias formalizadas.",
        "dependencies": []
    }
]